# IsEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SlabShapeEditor..::..IsEnabled Property
SlabShapeEditor Class See Also
---
Identifies if the slab shape editing functionality is enabled.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsEnabled { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsEnabled As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsEnabled {
	bool get ();
}
```

# Remarks
If true, the creases and vertices are accessible and modifiable. If false, no creases and vertices are accessible.
# See Also
SlabShapeEditor Class
Autodesk.Revit.DB Namespace